{"backend": "tensorflow", "config": [{"config": {"trainable": true, "implementation": 1, "return_state": false, "name": "lstm_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dropout": 0.0, "return_sequences": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "unroll": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "units": 256, "go_backwards": false, "batch_input_shape": [null, 40, 81], "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "implementation": 1, "return_state": false, "name": "lstm_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dropout": 0.0, "return_sequences": false, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "unroll": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "units": 256, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_constraint": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 81, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}